InformationRegisters/ИзмененияФизическихЛицБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияФизическихЛицБронированияКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияФизическихЛицБронированияКомандировок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьСотрудниковВСпискеОтправки(СистемаБронирования, ФизическоеЛицо) Экспорт

	Если СистемаБронирования = Неопределено Или ФизическоеЛицо = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Список = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	ИначеЕсли ТипЗнч(ФизическоеЛицо) = Тип("Массив") Тогда
		Список = ФизическоеЛицо;
	КонецЕсли;

	Запись = РегистрыСведений.ИзмененияФизическихЛицБронированияКомандировок.СоздатьМенеджерЗаписи();
	Для Каждого Элемент Из Список Цикл
		Запись.СистемаБронирования = СистемаБронирования;
		Запись.ФизическоеЛицо = Элемент;
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			Запись.СистемаБронирования = СистемаБронирования;
			Запись.ФизическоеЛицо = Элемент;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Истина);
		Запись.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;

КонецПроцедуры

Процедура УдалитьСотрудниковИзСпискаОтправки(СистемаБронирования, ФизическоеЛицо) Экспорт

	Если СистемаБронирования = Неопределено Или ФизическоеЛицо = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Список = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	ИначеЕсли ТипЗнч(ФизическоеЛицо) = Тип("Массив") Тогда
		Список = ФизическоеЛицо;
	КонецЕсли;

	Для Каждого Элемент Из Список Цикл
		Запись = РегистрыСведений.ИзмененияФизическихЛицБронированияКомандировок.СоздатьМенеджерЗаписи();
		Запись.СистемаБронирования = СистемаБронирования;
		Запись.ФизическоеЛицо = Элемент;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			УстановитьПривилегированныйРежим(Истина);
			Запись.Удалить();
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СотрудникВключенВСписокОтправки(СистемаБронирования, ФизическоеЛицо) Экспорт

	Запись = РегистрыСведений.ИзмененияФизическихЛицБронированияКомандировок.СоздатьМенеджерЗаписи();
	Запись.СистемаБронирования = СистемаБронирования;
	Запись.ФизическоеЛицо = ФизическоеЛицо;
	Запись.Прочитать();

	Возврат Запись.Выбран();

КонецФункции

#КонецОбласти

#КонецЕсли
